import {FC} from 'react'
import Video from '../components/video/Video'
import game from '../assets/game.mp4'
import SubTitle from '../components/subTitle/SubTitle'

const ProjectGame: FC = () => {
  return (
    <>
     <SubTitle title='ГОЛОВОЛОМКА С МЕХАНИКОЙ BLAST'/>
     <Video video={game}/>
      <p>
        Игра состоит из игрового поля произвольного размера N*M. В каждой ячейке поля находится игровой объект (далее именуемый тайл) определенного цвета. Количество возможных вариантов цветов равно C. 
        Начальное состояние поля задается случайно (вероятность цвета тайла является равновероятной). При клике на тайл сжигается (удаляется) область, состоящая из группы прилегающих тайлов того же цвета, размер группы не может быть меньше чем K (по умолчанию K=2). На месте удаленных должны образоваться пустые места.
        Далее происходит перемещение тайлов на пустые места сверху вниз. Если верхняя ячейка становится пустой, необходимо сгенерировать новый тайл и переместить его в эту ячейку. Процесс перемещения и добавление новых тайлов должен быть непрерывный и происходит до тех пор, пока поле снова не будет полностью заполнено.
        На заполненном поле всегда можно сжечь тайлы. Если такой возможности нет, то необходимо перемешать тайлы на поле (количество перемешиваний S). Если же после перемешивания нет возможности сжечь тайлы, то такая ситуация является проигрышем для игрока.     Цель игры – набрать X очков за Y ходов, иначе проигрыш. Значение количества очков и ходов для выигрыша, а также формула начисления очков остается на усмотрение соискателя.  
      </p>
  <a href='https://github.com/DmitriyPozdeev/tapclap' target='_blank'>
  github
</a>
    </>
  )
}
export default ProjectGame